marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Spi_TS_T2D35M10I0R0/include/Reg_eSys_DSPI.h
#define DSPI_CTAR_CPOL_LOW_U32       ((uint32)0x00000000u)
#define DSPI_CTAR_CPOL_HIGH_U32      ((uint32)0x04000000u)

#define DSPI_CTAR_CPHA_LEADING_U32   ((uint32)0x02000000u)
#define DSPI_CTAR_CPHA_TRAILING_U32  ((uint32)0x00000000u)

#define DSPI_CTAR_MSB_U32            ((uint32)0x00000000u)
#define DSPI_CTAR_LSB_U32            ((uint32)0x01000000u)

#define DSPI_CTAR_PCSCLK_0_U32       ((uint32)0x00000000u)
#define DSPI_CTAR_PCSCLK_1_U32       ((uint32)0x00000000u)
#define DSPI_CTAR_PCSCLK_3_U32       ((uint32)0x00400000u)
#define DSPI_CTAR_PCSCLK_5_U32       ((uint32)0x00800000u)
#define DSPI_CTAR_PCSCLK_7_U32       ((uint32)0x00C00000u)

#define DSPI_CTAR_PASC_0_U32         ((uint32)0x00000000u)
#define DSPI_CTAR_PASC_1_U32         ((uint32)0x00000000u)
#define DSPI_CTAR_PASC_3_U32         ((uint32)0x00100000u)
#define DSPI_CTAR_PASC_5_U32         ((uint32)0x00200000u)
#define DSPI_CTAR_PASC_7_U32         ((uint32)0x00300000u)

#define DSPI_CTAR_PDT_0_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_PDT_1_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_PDT_3_U32          ((uint32)0x00040000u)
#define DSPI_CTAR_PDT_5_U32          ((uint32)0x00080000u)
#define DSPI_CTAR_PDT_7_U32          ((uint32)0x000C0000u)

#define DSPI_CTAR_PBR_0_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_PBR_2_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_PBR_3_U32          ((uint32)0x00010000u)
#define DSPI_CTAR_PBR_5_U32          ((uint32)0x00020000u)
#define DSPI_CTAR_PBR_7_U32          ((uint32)0x00030000u)

#define DSPI_CTAR_SCSCLK_0_U32       ((uint32)0x00000000u)
#define DSPI_CTAR_SCSCLK_2_U32       ((uint32)0x00000000u)
#define DSPI_CTAR_SCSCLK_4_U32       ((uint32)0x00001000u)
#define DSPI_CTAR_SCSCLK_8_U32       ((uint32)0x00002000u)
#define DSPI_CTAR_SCSCLK_16_U32      ((uint32)0x00003000u)
#define DSPI_CTAR_SCSCLK_32_U32      ((uint32)0x00004000u)
#define DSPI_CTAR_SCSCLK_64_U32      ((uint32)0x00005000u)
#define DSPI_CTAR_SCSCLK_128_U32     ((uint32)0x00006000u)
#define DSPI_CTAR_SCSCLK_256_U32     ((uint32)0x00007000u)
#define DSPI_CTAR_SCSCLK_512_U32     ((uint32)0x00008000u)
#define DSPI_CTAR_SCSCLK_1024_U32    ((uint32)0x00009000u)
#define DSPI_CTAR_SCSCLK_2048_U32    ((uint32)0x0000A000u)
#define DSPI_CTAR_SCSCLK_4096_U32    ((uint32)0x0000B000u)
#define DSPI_CTAR_SCSCLK_8192_U32    ((uint32)0x0000C000u)
#define DSPI_CTAR_SCSCLK_16384_U32   ((uint32)0x0000D000u)
#define DSPI_CTAR_SCSCLK_32768_U32   ((uint32)0x0000E000u)
#define DSPI_CTAR_SCSCLK_65536_U32   ((uint32)0x0000F000u)

#define DSPI_CTAR_SASC_0_U32         ((uint32)0x00000000u)
#define DSPI_CTAR_SASC_2_U32         ((uint32)0x00000000u)
#define DSPI_CTAR_SASC_4_U32         ((uint32)0x00000100u)
#define DSPI_CTAR_SASC_8_U32         ((uint32)0x00000200u)
#define DSPI_CTAR_SASC_16_U32        ((uint32)0x00000300u)
#define DSPI_CTAR_SASC_32_U32        ((uint32)0x00000400u)
#define DSPI_CTAR_SASC_64_U32        ((uint32)0x00000500u)
#define DSPI_CTAR_SASC_128_U32       ((uint32)0x00000600u)
#define DSPI_CTAR_SASC_256_U32       ((uint32)0x00000700u)
#define DSPI_CTAR_SASC_512_U32       ((uint32)0x00000800u)
#define DSPI_CTAR_SASC_1024_U32      ((uint32)0x00000900u)
#define DSPI_CTAR_SASC_2048_U32      ((uint32)0x00000A00u)
#define DSPI_CTAR_SASC_4096_U32      ((uint32)0x00000B00u)
#define DSPI_CTAR_SASC_8192_U32      ((uint32)0x00000C00u)
#define DSPI_CTAR_SASC_16384_U32     ((uint32)0x00000D00u)
#define DSPI_CTAR_SASC_32768_U32     ((uint32)0x00000E00u)
#define DSPI_CTAR_SASC_65536_U32     ((uint32)0x00000F00u)

#define DSPI_CTAR_SDT_0_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_SDT_2_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_SDT_4_U32          ((uint32)0x00000010u)
#define DSPI_CTAR_SDT_8_U32          ((uint32)0x00000020u)
#define DSPI_CTAR_SDT_16_U32         ((uint32)0x00000030u)
#define DSPI_CTAR_SDT_32_U32         ((uint32)0x00000040u)
#define DSPI_CTAR_SDT_64_U32         ((uint32)0x00000050u)
#define DSPI_CTAR_SDT_128_U32        ((uint32)0x00000060u)
#define DSPI_CTAR_SDT_256_U32        ((uint32)0x00000070u)
#define DSPI_CTAR_SDT_512_U32        ((uint32)0x00000080u)
#define DSPI_CTAR_SDT_1024_U32       ((uint32)0x00000090u)
#define DSPI_CTAR_SDT_2048_U32       ((uint32)0x000000A0u)
#define DSPI_CTAR_SDT_4096_U32       ((uint32)0x000000B0u)
#define DSPI_CTAR_SDT_8192_U32       ((uint32)0x000000C0u)
#define DSPI_CTAR_SDT_16384_U32      ((uint32)0x000000D0u)
#define DSPI_CTAR_SDT_32768_U32      ((uint32)0x000000E0u)
#define DSPI_CTAR_SDT_65536_U32      ((uint32)0x000000F0u)

#define DSPI_CTAR_SBR_0_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_SBR_2_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_SBR_4_U32          ((uint32)0x00000001u)
#define DSPI_CTAR_SBR_6_U32          ((uint32)0x00000002u)
#define DSPI_CTAR_SBR_8_U32          ((uint32)0x00000003u)
#define DSPI_CTAR_SBR_16_U32         ((uint32)0x00000004u)
#define DSPI_CTAR_SBR_32_U32         ((uint32)0x00000005u)
#define DSPI_CTAR_SBR_64_U32         ((uint32)0x00000006u)
#define DSPI_CTAR_SBR_128_U32        ((uint32)0x00000007u)
#define DSPI_CTAR_SBR_256_U32        ((uint32)0x00000008u)
#define DSPI_CTAR_SBR_512_U32        ((uint32)0x00000009u)
#define DSPI_CTAR_SBR_1024_U32       ((uint32)0x0000000Au)
#define DSPI_CTAR_SBR_2048_U32       ((uint32)0x0000000Bu)
#define DSPI_CTAR_SBR_4096_U32       ((uint32)0x0000000Cu)
#define DSPI_CTAR_SBR_8192_U32       ((uint32)0x0000000Du)
#define DSPI_CTAR_SBR_16384_U32      ((uint32)0x0000000Eu)
#define DSPI_CTAR_SBR_32768_U32      ((uint32)0x0000000Fu)

/* DSPI CMD attributes */
#define DSPI_CMD_CONTINOUS_FALSE_U32  ((uint32)0x00000000u)
#define DSPI_CMD_CONTINOUS_TRUE_U32   ((uint32)0x80000000u)

#define DSPI_CMD_CTAR_SEL_0_U32     ((uint32)0x00000000u)
#define DSPI_CMD_CTAR_SEL_1_U32     ((uint32)0x10000000u)
#define DSPI_CMD_CTAR_SEL_2_U32     ((uint32)0x20000000u)
#define DSPI_CMD_CTAR_SEL_3_U32     ((uint32)0x30000000u)
#define DSPI_CMD_CTAR_SEL_4_U32     ((uint32)0x40000000u)
#define DSPI_CMD_CTAR_SEL_5_U32     ((uint32)0x50000000u)
#define DSPI_CMD_CTAR_SEL_6_U32     ((uint32)0x60000000u)
#define DSPI_CMD_CTAR_SEL_7_U32     ((uint32)0x70000000u)

#define DSPI_CMD_MSB_U32             ((uint32)0x00000000u)
#define DSPI_CMD_LSB_U32             ((uint32)0x01000000u)

#define DSPI_CMD_WIDTH_4_U32         ((uint32)0x18000000u)
#define DSPI_CMD_WIDTH_5_U32         ((uint32)0x20000000u)
#define DSPI_CMD_WIDTH_6_U32         ((uint32)0x28000000u)
#define DSPI_CMD_WIDTH_7_U32         ((uint32)0x30000000u)
#define DSPI_CMD_WIDTH_8_U32         ((uint32)0x38000000u)
#define DSPI_CMD_WIDTH_9_U32         ((uint32)0x40000000u)
#define DSPI_CMD_WIDTH_10_U32        ((uint32)0x48000000u)
#define DSPI_CMD_WIDTH_11_U32        ((uint32)0x50000000u)
#define DSPI_CMD_WIDTH_12_U32        ((uint32)0x58000000u)
#define DSPI_CMD_WIDTH_13_U32        ((uint32)0x60000000u)
#define DSPI_CMD_WIDTH_14_U32        ((uint32)0x68000000u)
#define DSPI_CMD_WIDTH_15_U32        ((uint32)0x70000000u)
#define DSPI_CMD_WIDTH_16_U32        ((uint32)0x78000000u)

#define DSPI_CMD_PCS0_U32            ((uint32)0x00010000u)
#define DSPI_CMD_PCS1_U32            ((uint32)0x00020000u)
#define DSPI_CMD_PCS2_U32            ((uint32)0x00040000u)
#define DSPI_CMD_PCS3_U32            ((uint32)0x00080000u)
#define DSPI_CMD_PCS4_U32            ((uint32)0x00100000u)
#define DSPI_CMD_PCS5_U32            ((uint32)0x00200000u)
#define DSPI_CMD_PCS6_U32            ((uint32)0x00400000u)
#define DSPI_CMD_PCS7_U32            ((uint32)0x00800000u)

#ifdef TSB_MODE_SUPPORTED
/*DSI Configuration Register selects various attributes associated
with DSI and CSI Configurations.*/
/*TSBC bit enables the Timed Serial Bus Configuration.*/
#define DSPI_DSICR_TSBC_U32           ((uint32)0x00100000u)
#ifdef ITSB_MODE_SUPPORTED
/*iTSBC bit enables the Interleave Timed Serial Bus Configuration.*/
#define DSPI_DSICR_ITSBC_U32          ((uint32)0x00300000u)
#endif /*ITSB_MODE_SUPPORTED*/
/*ctar3 selection*/
#define DSPI_DSICR_DSICTAS_CTAR3_U32  ((uint32)0x00003000u)
#endif /*TSB_MODE_SUPPORTED*/

/**
* @brief Macros used for low-level DSPI register read/writes operations (begin section).
*/

/* ---------- Read transfer count register to manage queue --Start ---------- */

/* Read TXCTR FIFO value - Nibble */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_SR_TXCTR_VAL_U32(value) \
    (((value) & DSPI_SR_TXCTR_MASK_U32) >> 12 )

/* Read RXCTR FIFO value - Nibble */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_SR_RXCTR_VAL_U32(value) \
    (((value) & DSPI_SR_RXCTR_MASK_U32) >> 4 )


/* ---------------DSPI FIFO Transmit Register - End-------------------------- */

#ifdef TSB_MODE_SUPPORTED
/*----------------DSPI DSI Configuration Register DSPI_DSICR -----------------------------*/
/*Timed Serial Bus Configuration enabled*/
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_TXSS_SET_U32       ((uint32)0x00080000u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_TXSS_CLEAR_U32     ((uint32)0x00000000u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CID_SET_U32        ((uint32)0x00010000u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CID_CLEAR_U32      ((uint32)0x00000000u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS0_U32       ((uint32)0x00000001u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS1_U32       ((uint32)0x00000002u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS2_U32       ((uint32)0x00000004u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS3_U32       ((uint32)0x00000008u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS4_U32       ((uint32)0x00000010u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS5_U32       ((uint32)0x00000020u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS6_U32       ((uint32)0x00000040u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_CS_DPCS7_U32       ((uint32)0x00000080u)

/*----------------DSPI DSI Configuration Register1 DSPI_DSICR1 -----------------------------*/
#define DSPI_DSICR1_CS_DPCS0_U32       ((uint32)0x00000001u)
#define DSPI_DSICR1_CS_DPCS1_U32       ((uint32)0x00000002u)
#define DSPI_DSICR1_CS_DPCS2_U32       ((uint32)0x00000004u)
#define DSPI_DSICR1_CS_DPCS3_U32       ((uint32)0x00000008u)
#define DSPI_DSICR1_CS_DPCS4_U32       ((uint32)0x00000010u)
#define DSPI_DSICR1_CS_DPCS5_U32       ((uint32)0x00000020u)
#define DSPI_DSICR1_CS_DPCS6_U32       ((uint32)0x00000040u)
#define DSPI_DSICR1_CS_DPCS7_U32       ((uint32)0x00000080u)
#define DSPI_DSICR1_TSBCNT_3_U32       ((uint32)0x03000000u)
#define DSPI_DSICR1_TSBCNT_4_U32       ((uint32)0x04000000u)
#define DSPI_DSICR1_TSBCNT_5_U32       ((uint32)0x05000000u)
#define DSPI_DSICR1_TSBCNT_6_U32       ((uint32)0x06000000u)
#define DSPI_DSICR1_TSBCNT_7_U32       ((uint32)0x07000000u)
#define DSPI_DSICR1_TSBCNT_8_U32       ((uint32)0x08000000u)
#define DSPI_DSICR1_TSBCNT_9_U32       ((uint32)0x09000000u)
#define DSPI_DSICR1_TSBCNT_10_U32      ((uint32)0x0A000000u)
#define DSPI_DSICR1_TSBCNT_11_U32      ((uint32)0x0B000000u)
#define DSPI_DSICR1_TSBCNT_12_U32      ((uint32)0x0C000000u)
#define DSPI_DSICR1_TSBCNT_13_U32      ((uint32)0x0D000000u)
#define DSPI_DSICR1_TSBCNT_14_U32      ((uint32)0x0E000000u)
#define DSPI_DSICR1_TSBCNT_15_U32      ((uint32)0x0F000000u)
#define DSPI_DSICR1_TSBCNT_16_U32      ((uint32)0x10000000u)
#define DSPI_DSICR1_TSBCNT_17_U32      ((uint32)0x11000000u)
#define DSPI_DSICR1_TSBCNT_18_U32      ((uint32)0x12000000u)
#define DSPI_DSICR1_TSBCNT_19_U32      ((uint32)0x13000000u)
#define DSPI_DSICR1_TSBCNT_20_U32      ((uint32)0x14000000u)
#define DSPI_DSICR1_TSBCNT_21_U32      ((uint32)0x15000000u)
#define DSPI_DSICR1_TSBCNT_22_U32      ((uint32)0x16000000u)
#define DSPI_DSICR1_TSBCNT_23_U32      ((uint32)0x17000000u)
#define DSPI_DSICR1_TSBCNT_24_U32      ((uint32)0x18000000u)
#define DSPI_DSICR1_TSBCNT_25_U32      ((uint32)0x19000000u)
#define DSPI_DSICR1_TSBCNT_26_U32      ((uint32)0x1A000000u)
#define DSPI_DSICR1_TSBCNT_27_U32      ((uint32)0x1B000000u)
#define DSPI_DSICR1_TSBCNT_28_U32      ((uint32)0x1C000000u)
#define DSPI_DSICR1_TSBCNT_29_U32      ((uint32)0x1D000000u)
#define DSPI_DSICR1_TSBCNT_30_U32      ((uint32)0x1E000000u)
#define DSPI_DSICR1_TSBCNT_31_U32      ((uint32)0x1F000000u)
#define DSPI_DSICR1_TSBCNT_32_U32      ((uint32)0x20000000u)
#define DSPI_DSICR1_TSBCNT_33_U32      ((uint32)0x21000000u)
#define DSPI_DSICR1_TSBCNT_34_U32      ((uint32)0x22000000u)
#define DSPI_DSICR1_TSBCNT_35_U32      ((uint32)0x23000000u)
#define DSPI_DSICR1_TSBCNT_36_U32      ((uint32)0x24000000u)
#define DSPI_DSICR1_TSBCNT_37_U32      ((uint32)0x25000000u)
#define DSPI_DSICR1_TSBCNT_38_U32      ((uint32)0x26000000u)
#define DSPI_DSICR1_TSBCNT_39_U32      ((uint32)0x27000000u)
#define DSPI_DSICR1_TSBCNT_40_U32      ((uint32)0x28000000u)
#define DSPI_DSICR1_TSBCNT_41_U32      ((uint32)0x29000000u)
#define DSPI_DSICR1_TSBCNT_42_U32      ((uint32)0x2A000000u)
#define DSPI_DSICR1_TSBCNT_43_U32      ((uint32)0x2B000000u)
#define DSPI_DSICR1_TSBCNT_44_U32      ((uint32)0x2C000000u)
#define DSPI_DSICR1_TSBCNT_45_U32      ((uint32)0x2D000000u)
#define DSPI_DSICR1_TSBCNT_46_U32      ((uint32)0x2E000000u)
#define DSPI_DSICR1_TSBCNT_47_U32      ((uint32)0x2F000000u)
#define DSPI_DSICR1_TSBCNT_48_U32      ((uint32)0x30000000u)
#define DSPI_DSICR1_TSBCNT_49_U32      ((uint32)0x31000000u)
#define DSPI_DSICR1_TSBCNT_50_U32      ((uint32)0x32000000u)
#define DSPI_DSICR1_TSBCNT_51_U32      ((uint32)0x33000000u)
#define DSPI_DSICR1_TSBCNT_52_U32      ((uint32)0x34000000u)
#define DSPI_DSICR1_TSBCNT_53_U32      ((uint32)0x35000000u)
#define DSPI_DSICR1_TSBCNT_54_U32      ((uint32)0x36000000u)
#define DSPI_DSICR1_TSBCNT_55_U32      ((uint32)0x37000000u)
#define DSPI_DSICR1_TSBCNT_56_U32      ((uint32)0x38000000u)
#define DSPI_DSICR1_TSBCNT_57_U32      ((uint32)0x39000000u)
#define DSPI_DSICR1_TSBCNT_58_U32      ((uint32)0x3A000000u)
#define DSPI_DSICR1_TSBCNT_59_U32      ((uint32)0x3B000000u)
#define DSPI_DSICR1_TSBCNT_60_U32      ((uint32)0x3C000000u)
#define DSPI_DSICR1_TSBCNT_61_U32      ((uint32)0x3D000000u)
#define DSPI_DSICR1_TSBCNT_62_U32      ((uint32)0x3E000000u)
#define DSPI_DSICR1_TSBCNT_63_U32      ((uint32)0x3F000000u)
#define DSPI_DUALRECEIVER_DISABLED_U32 ((uint32)0x00000000u)
#define DSPI_DSICR1_DSI64E_MASK_U32    ((uint32)0x00040000u)

#endif /*TSB_MODE_SUPPORTED*/

#ifdef ITSB_MODE_SUPPORTED
/*----------------DSPI Time Slot Configuration Register DSPI_TS_CONF -----------------------------*/
/*Interleave Timed Serial Bus Configuration enabled*/
/*----------------Time Slot 3 Configuration -----------------------------*/
#define DSPI_TS_CONF_TS3_PF_U32       ((uint32)0x00000000u)
#define DSPI_TS_CONF_TS3_SRDF_U32     ((uint32)0x00001000u)
#define DSPI_TS_CONF_TS3_DRF1_U32     ((uint32)0x00002000u)
#define DSPI_TS_CONF_TS3_DRF2_U32     ((uint32)0x00003000u)
#define DSPI_TS_CONF_TS3_CMD_PF_U32   ((uint32)0x00004000u)
#define DSPI_TS_CONF_TS3_CMD_SRDF_U32 ((uint32)0x00005000u)
#define DSPI_TS_CONF_TS3_CMD_DRF1_U32 ((uint32)0x00006000u)
#define DSPI_TS_CONF_TS3_CMD_DRF2_U32 ((uint32)0x00007000u)
/*----------------Time Slot 2 Configuration -----------------------------*/
#define DSPI_TS_CONF_TS2_PF_U32       ((uint32)0x00000000u)
#define DSPI_TS_CONF_TS2_SRDF_U32     ((uint32)0x00000100u)
#define DSPI_TS_CONF_TS2_DRF1_U32     ((uint32)0x00000200u)
#define DSPI_TS_CONF_TS2_DRF2_U32     ((uint32)0x00000300u)
#define DSPI_TS_CONF_TS2_CMD_PF_U32   ((uint32)0x00000400u)
#define DSPI_TS_CONF_TS2_CMD_SRDF_U32 ((uint32)0x00000500u)
#define DSPI_TS_CONF_TS2_CMD_DRF1_U32 ((uint32)0x00000600u)
#define DSPI_TS_CONF_TS2_CMD_DRF2_U32 ((uint32)0x00000700u)
/*----------------Time Slot 1 Configuration -----------------------------*/
#define DSPI_TS_CONF_TS1_PF_U32       ((uint32)0x00000000u)
#define DSPI_TS_CONF_TS1_SRDF_U32     ((uint32)0x00000010u)
#define DSPI_TS_CONF_TS1_DRF1_U32     ((uint32)0x00000020u)
#define DSPI_TS_CONF_TS1_DRF2_U32     ((uint32)0x00000030u)
#define DSPI_TS_CONF_TS1_CMD_PF_U32   ((uint32)0x00000040u)
#define DSPI_TS_CONF_TS1_CMD_SRDF_U32 ((uint32)0x00000050u)
#define DSPI_TS_CONF_TS1_CMD_DRF1_U32 ((uint32)0x00000060u)
#define DSPI_TS_CONF_TS1_CMD_DRF2_U32 ((uint32)0x00000070u)
/*----------------Time Slot 0 Configuration -----------------------------*/
#define DSPI_TS_CONF_TS0_PF_U32       ((uint32)0x00000000u)
#define DSPI_TS_CONF_TS0_SRDF_U32     ((uint32)0x00000001u)
#define DSPI_TS_CONF_TS0_DRF1_U32     ((uint32)0x00000002u)
#define DSPI_TS_CONF_TS0_DRF2_U32     ((uint32)0x00000003u)
#define DSPI_TS_CONF_TS0_CMD_PF_U32   ((uint32)0x00000004u)
#define DSPI_TS_CONF_TS0_CMD_SRDF_U32 ((uint32)0x00000005u)
#define DSPI_TS_CONF_TS0_CMD_DRF1_U32 ((uint32)0x00000006u)
#define DSPI_TS_CONF_TS0_CMD_DRF2_U32 ((uint32)0x00000007u)
#endif /*ITSB_MODE_SUPPORTED*/

/*==================================================================================================
*                                            ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/


#ifdef __cplusplus
}
#endif

#endif /* REG_eSys_DSPI_H */



/** @} */
